#+TITLE: JavaScript API - performance
#+DATE: <2021-09-24 11:53:12>
#+EMAIL: Lee ZhiCheng<gccll.love@gmail.com>
#+TAGS[]: javascript, performance
#+CATEGORIES[]: javascript, web
#+LANGUAGE: zh-cn
#+STARTUP: indent

#+begin_export html
<script src="/js/utils.js"></script>
<script src="/js/performance.js"></script>
#+end_export

#+begin_quote
本方讲述的是 [[https://w3c.github.io/hr-time/#sotd][performance]] api. 本文所有内容都来自 w3c 标准，英语不好翻译的很蹩脚
;(，如果不关心概念性东西可直接跳转到 [[#performance][Performance API]] 或 [[https://developer.mozilla.org/en-US/docs/Web/API/Performance][MDN API Doc]]。
#+end_quote

* 简介
:PROPERTIES:
:COLUMNS:  %CUSTOM_ID[(Custom Id)]
:CUSTOM_ID: introduce
:END:

在 [[https://w3c.github.io/hr-time/#bib-ecma-262][ECMA-262]] 标准中定义了 [[https://tc39.es/ecma262/multipage/#sec-date-objects][Date]] 对象做为时间值，代表着从 1970-01-01(UTC) 开始的
毫秒数。从 1970-01-01 开始大约 285,616 年的时间内毫秒数在大部分情况下是足够用
了。[[https://heycam.github.io/webidl/#DOMTimeStamp][DOMTimeStamp]] 有相同的定义[[[https://w3c.github.io/hr-time/#bib-webidl][WEBIDl]]]。

在实际的实践和使用当中，这些时间的定义都受制于时钟偏移(clock skew)和系统时钟的调
整。时间的值并不总是单调递增的并且随后的值可能递增或保持原值。

比如，下面的代码中 ~duration~ 的值有可能是一个正数，负数或零：

#+begin_src js
function doSth() {
  let i = 0
  while (true) {
    if (++i>100) break
  }
}
var mark_start = Date.now()
doSth()
var duration = Date.now() - mark_start
console.log(duration)
#+end_src

#+RESULTS:
: 0
: undefined

在特定的情况下时间的定义明显不能够满足实际情况：

1. 没有一个稳定的单调时钟，更何况还要依赖系统时钟偏移
2. 没有提供亚毫秒级(sub-millisecond)的时间精度


Date.now() 就存在上面的问题，但是它依旧在大部分情况下可以使用。

只不过如果需要精确到亚毫秒级可能就不太合适，此时可以考虑使用 [[https://w3c.github.io/hr-time/#dom-domhighrestimestamp][DOMHighResTimeStamp]]
类型， [[https://w3c.github.io/hr-time/#dom-performance][Performance]].[[https://w3c.github.io/hr-time/#dom-performance-now][now()]] 和 [[https://w3c.github.io/hr-time/#dom-performance][Performance]] 接口的属性 [[https://w3c.github.io/hr-time/#dom-performance][Performance]].[[https://w3c.github.io/hr-time/#dom-performance-timeorigin][timeOrigin]] 去解决
这这些问题，因为它们提供了 *亚毫秒级精度* 的 *单调递增* 的时间值 。

#+begin_tip
@@html:<p><strong>NOTE</strong></p>@@

亚毫秒级精度并非标准的一部分。实现方可以依据它们的隐私和安全性理由选择性的去暴露
对时间的精度的限制，以及是否要公开亚毫秒级时间。所以当用户使用依赖亚毫秒级时间的特
性的时候可能并不总能如愿以偿(不是标准，效果不一定好)。
#+end_tip

